In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
from sklearn.linear_model import LinearRegression as LR
from sklearn.ensemble import RandomForestClassifier

In [2]:
df_train = pd.read_csv("train.csv")

In [3]:
df_test = pd.read_csv("test.csv")

In [4]:
print(df_train.shape)
print(df_test.shape)

(891, 12)
(418, 11)

In [5]:
df_train["Sex"] = pd.get_dummies(df_train[["Sex"]])

In [6]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df_train["Embarked"] = pd.get_dummies(df_train["Embarked"])

In [8]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,1
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,0
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,0

In [9]:
df_test["Sex"] = pd.get_dummies(df_test[["Sex"]])

In [10]:
df_test["Embarked"] = pd.get_dummies(df_test["Embarked"])

In [11]:
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,363272,7.0000,NaN,0
2,894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,0
3,895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,3101298,12.2875,NaN,0

In [12]:
df_train2 = df_train.drop(["PassengerId", "Name", "Ticket", "Cabin"], axis=1)

In [13]:
df_test2 = df_test.drop(["PassengerId","Name", "Ticket", "Cabin"], axis=1)

In [14]:
df_train2.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      0
dtype: int64

In [15]:
# 指定した列名=Ageでの欠損値を含む行をすべて削除。
df_train3 = df_train2.dropna(subset=['Age'])

In [16]:
df_train3.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [18]:
# testデータは行を削除してしまうと提出する際に元testデータとインデックスの数が揃わずエラーが発生する
# ややこしいので行ごと削除するのではなく欠損値を補完する方向に
# df_test3 = df_test2.dropna(subset=['Age', "Fare"])
df_test2["Age"] = df_test2["Age"].fillna(df_test2["Age"].median())

In [19]:
df_test2["Fare"] = df_test2["Fare"].fillna(df_test2["Fare"].median())

In [20]:
df_test2.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [21]:
df_train3.corr()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
Survived,1.000000,-0.359653,0.538826,-0.077221,-0.017358,0.093317,0.268189,0.193607
Pclass,-0.359653,1.000000,-0.155460,-0.369226,0.067247,0.025683,-0.554182,-0.276294
Sex,0.538826,-0.155460,1.000000,-0.093254,0.103950,0.246972,0.184994,0.101580
Age,-0.077221,-0.369226,-0.093254,1.000000,-0.308247,-0.189119,0.096067,0.036261
SibSp,-0.017358,0.067247,0.103950,-0.308247,1.000000,0.383820,0.138329,-0.045462
Parch,0.093317,0.025683,0.246972,-0.189119,0.383820,1.000000,0.205119,-0.008846
Fare,0.268189,-0.554182,0.184994,0.096067,0.138329,0.205119,1.000000,0.299797
Embarked,0.193607,-0.276294,0.101580,0.036261,-0.045462,-0.008846,0.299797,1.000000

In [22]:
# Survivedと相関が高い"Sex", "Fare", "Embarked"を特徴量として選択
X_train = df_train3[["Sex", "Fare", "Embarked"]]

In [23]:
Y_train = df_train3["Survived"]

In [24]:
model = RandomForestClassifier(n_estimators = 100, random_state=0)

In [25]:
model = model.fit(X_train, Y_train)

In [26]:
X_test = df_test2[["Sex", "Fare", "Embarked"]]

In [27]:
Y_test = model.predict(X_test)

In [28]:
output = pd.read_csv("test.csv")

In [29]:
output["Survived"] = Y_test

In [30]:
Y_test.shape

(418,)

In [31]:
output[["PassengerId","Survived"]].to_csv("output_submission_180505.csv",index=False)

In [ ]:
# ---これで終了。カレントディレクトリに出力されたoutput_submission_180505.csvファイルをkaggleに提出→正解率は0.75119と前回よりアップ